tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "zegervdv/zathura"
# Run your GitHub Actions locally 🚀
brew "act"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Download with resuming and segmented downloading
brew "aria2"
# GNOME accessibility toolkit
brew "atk"
# Automatic configure script builder
brew "autoconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Statistics utility to count lines of code
brew "cloc"
# Color-highlighted diff(1) output
brew "colordiff"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Easiest way to build and release mobile apps
brew "fastlane"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Distributed revision control system
brew "git"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Statically typed programming language for the JVM
brew "kotlin"
# Library that provides automatic proxy configuration management
brew "libproxy"
# Web and API based SMTP testing tool
brew "mailhog"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Open source relational database management system
brew "mysql", restart_service: true
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# General-purpose scripting language
brew "php"
# General-purpose scripting language
brew "php@7.4"
# General-purpose scripting language
brew "php@8.0"
# Python dependency management tool
brew "pipenv", link: false
# Cross-platform application and UI framework
brew "qt"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql", restart_service: true
# Password generator
brew "pwgen"
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.0"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# User interface to the TELNET protocol
brew "telnet"
# CLI tool that moves files or folder to the trash
brew "trash"
# Command-line client for Travis CI
brew "travis"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# An interactive JavaScript command-line interface to MongoDB
brew "mongodb/brew/mongodb-community-shell"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.4"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Apple TV Aerial screensaver
cask "aerial"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Productivity platform for tasks, docs, goals, and chat
cask "clickup"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Draw.io is free online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Virtual video-calling space
cask "gather"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# WiFi site survey software and WiFi scanner
cask "netspot"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Simulate the notch on the MacBook Pro
cask "notch-simulator"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# HTTP client that helps testing and describing APIs
cask "paw"
# Browser designed for modern work
cask "pushplaylabs-sidekick"
# Control your tools with a few keystrokes
cask "raycast"
# Visible indicator of the current input source
cask "showyedge"
# Graphical client for Git version control
cask "sourcetree"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Break time reminder app
cask "stretchly"
# IDE, client, and GUI for MongoDB
cask "studio-3t"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Development environment
cask "vagrant"
# Virtualizer for x86 hardware
cask "virtualbox"
# Multimedia player
cask "vlc"
# View output from scripts in the menu bar
cask "xbar"
# Mind mapping and brainstorming tool
cask "xmind"
# Share, organize and collaborate on designs
cask "zeplin"
